your_lang = 'Это твой язык'

greeting = """Привет! 👋
Я - Ботик, модератор Догонялок 2.0. Это необычные догонялки. В них можно играть с жителями разных планет в киберпространстве. 
"""

greeting_2 = """Давай сыграем! Нажми на кнопку внизу экрана, чтобы выбрать соперника ⤵️"""

fox_greeting = """Знакомься, это Фоксфорд с планеты Орза. А как тебя зовут? Напиши своё имя ⤵️"""

rules = """Вот и познакомились! ☺️ А теперь давай ознакомимся с правилами Догонялок. Они простые."""
rules_2 = """ПРАВИЛА ДОГОНЯЛОК 2.0:

1️⃣ Ты будешь бегать по улицам Розы Хутор, а Фоксфорд в киберпространстве. 
2️⃣ Чтобы выиграть, тебе нужно добежать до флага быстрее Фоксфорда. Флагов всего четыре. 
3️⃣ Иногда нужно будет прятаться или ускоряться. Я буду подсказывать тебе, что делать. 
4️⃣ Когда добежишь до флага, нажми на кнопку «Я у флага» (она будет внизу экрана).
"""
rules_3 = """Если ты готов, жми на кнопку ⤵️"""

task_1_1 = """Прочитай подсказку и догадайся, где находится первый флаг:"""
task_1_2 = """Звездолет летит вперед 
Ты теперь его пилот
Букву <b>"R"</b> под светом звезд
Ты найдешь, взлетев на <b>мост</b>
Подсказку сразу дам тебе -
Взлетай на мост на букву П.
"""
task_1_3 = """Когда добежишь до флага, нажми на кнопку «Я у флага» ⤵️"""

timecode_1_1 = """Фоксфорд догадался, где находится флаг, и бежит к нему. """
timecode_1_2 = """Давай запутаем его! Развернись и пробеги несколько метров в обратную сторону. А потом беги к флагу. Когда добежишь до флага, нажми на кнопку «Я у флага» ⤵️"""

task_question_1 = """Ты молодец! 👏 А Фоксфорд побежал к другому мосту. Скорее найди и отсканируй QR-код. Прочитай вопрос и напиши ответ сюда ⤵️"""
task_question_1_wrong = """Похоже, ты не угадал или неправильно написал главного героя. Подумай еще! 
Название фильма писать не нужно, только имя и фамилию главного героя на русском языке. """

task_1_correct = """Ну что, погнали дальше? Теперь Фоксфорд будет догонять тебя. """
task_1_correct_2 = "Нажми на кнопку ⤵️"

task_2_1 = """Вот куда нужно бежать:
Летит в космической дали
Стальной корабль вокруг Земли.
Там букву <b>"S"</b> ты, друг, найдешь,
Где дом на <b>Ратушу</b> похож."""

task_2_2 = """Когда добежишь до флага, нажми на кнопку «Я у флага» ⤵️"""

timecode_2_1 = """Фоксфорд взял киберсамокат, чтобы догнать тебя. Беги со всех ног!"""
timecode_2_2 = """Фоксфорд догнал тебя и выиграл этот раунд! """
timecode_2_3 = """Не расстраивайся, ты еще сможешь его обогнать! 💪 Добеги до флага и нажми на кнопку «Я у флага» ⤵️"""

task_question_2 = """Найди и отсканируй QR-код. Прочитай вопрос и напиши ответ сюда ⤵️"""
task_question_2_wrong = """Неверно"""
task_2_correct = """Погнали к следующему флагу? Теперь ты будешь догонять Фоксфорда. """
task_2_correct_2 = """Нажми на кнопку ⤵️"""

task_3_1 = """Вот куда нужно бежать:
В темном небе звезды светят,
Космонавт летит в ракете.
Букву <b>"О"</b> доставил он
В <b>Горный клуб Спорт-Марафон</b>
"""

task_3_2 = """Когда добежишь до флага, нажми на кнопку «Я у флага» ⤵️"""

timecode_3_1 = """Фоксфорд догадался, где находится <b>«Спорт-Марафон»</b>.  Ускоряйся, чтобы догнать его."""
timecode_3_2 = """Фоксфорд добежал первым и выиграл этот раунд! """
timecode_3_3 = """Не расстраивайся, ты еще сможешь его обогнать! 💪 Добеги до флага и нажми на кнопку «Я у флага» ⤵️"""

task_question_3 = """Теперь найди и отсканируй QR-код. Прочитай вопрос и напиши ответ сюда ⤵️"""

task_3_correct = """Погнали к следующему флагу?  Теперь Фоксфорд будет догонять тебя."""
task_3_correct_2 = """Нажми на кнопку ⤵️"""

task_4_1 = """Вот тебе подсказка:
На ракете полетаю
И планету Марс узнаю.
<b>Там на пляже средь песка</b>
Спрятали мы букву <b>"А"</b>
"""
task_4_2 = """Когда добежишь до флага, нажми на кнопку «Я у флага» ⤵️"""

timecode_4_1 = """Фоксфорд приближается! Замри на месте и стой неподвижно 15 секунд. Так он не сможет тебя распознать. А потом скорее беги вверх по течению реки!"""
timecode_4_2 = """Фоксфорд догнал тебя и выиграл этот раунд! """
timecode_4_3 = """Не расстраивайся, игра еще не окончена. Добеги до флага и нажми на кнопку «Я у флага» ⤵️"""

task_question_4 = """Теперь найди и отсканируй QR-код. Прочитай вопрос и напиши ответ сюда ⤵️"""
task_question_4_2 = """Поздравляю! 🥳 Ты нашел все 4 флага и собрал 4 буквы. Составь из них слово и напиши его ⤵️"""

task_4_correct = """Верно! А теперь погнали наперегонки на финиш до стойки регистрации. Кто быстрее - ты или Фоксфорд? Нажми на кнопку ⤵️"""

task_5_1 = """Когда добежишь до финиша, нажми на кнопку «Я на финише» ⤵️"""

timecode_5_1 = """Фоксфорд немного устал, но пытается тебя догнать. Ускоряйся, чтобы быть первым на финише!"""

task_5_finished_word = """Теперь напиши кодовое слово, чтобы завершить гонку"""

end_1 = "Ты молодец! Ты прибежал первым! 🎉"
end_2 = """Спасибо тебе за игру! Фоксфорду очень понравилось с тобой играть. """
end_3 = """А тебе понравился квест? Напиши свои впечатления. Что больше всего понравилось и запомнилось?  ⤵️"""
end_4 = """Покажи картинку со словом ROSA координаторам на стойке регистрации и получи подарок 🎁"""
end_5 = """До новых встреч на Догонялках 2.0! 👋"""

submitted = """Отзыв принят"""
wrong_answer = "Неверно"


wrong_btn_input = "Не понимаю, нажми кнопку ниже"

ask_secret = 'Теперь введите секретное слово, которое вы найдете на финише'


choose_enemy_btn = "Выбрать соперника"
begin_btn = "🚀 ПОГНАЛИ 🚀"
flag_achieved_btn = "Я У ФЛАГА"
run_next_btn = "БЕЖИМ ДАЛЬШЕ"
run_to_finish_btn = "БЕЖИМ НА ФИНИШ"
finished_btn = "Я НА ФИНИШЕ"